УТ/src/Catalogs/CRM_ПотенциальныеКлиенты/CRM_ПотенциальныеКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПотенциальныеКлиенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор в системе идентификации по лицу</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_ИсторияРеквизитовОбъектов/CRM_ИсторияРеквизитовОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИсторияРеквизитовОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>РеквизитТип</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтароеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтароеЗначениеСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтароеЗначениеИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>EnumRef.CRM_ВидыЗаписейИстории</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючУникальности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/InformationRegisters/CRM_СвязанныеПотенциальныеКлиенты/CRM_СвязанныеПотенциальныеКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СвязанныеПотенциальныеКлиенты</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПотенциальныйКлиентА</name>
    <type>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПотенциальныйКлиентБ</name>
    <type>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Catalogs/CRM_ПотенциальныеКлиенты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОтборТелефон = Новый Структура("Тип, CRM_ОсновнойДляСвязи", Перечисления.ТипыКонтактнойИнформации.Телефон, Истина);
	ОтборЭП		 = Новый Структура("Тип, CRM_ОсновнойДляСвязи",
		 Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
		 Истина);
	ЕстьОсновнойТелефон = (КонтактнаяИнформация.НайтиСтроки(ОтборТелефон).Количество() > 0);
	ЕстьОсновнойАдресЭП	= (КонтактнаяИнформация.НайтиСтроки(ОтборЭП).Количество() > 0);
	
	Если НЕ ЕстьОсновнойТелефон Тогда
		ОтборТелефон.Удалить("CRM_ОсновнойДляСвязи");
		СтрокиТелефон = КонтактнаяИнформация.НайтиСтроки(ОтборТелефон);
		
		Если СтрокиТелефон.Количество() > 0 Тогда
			ОсновнойТелефонСтрока = СтрокиТелефон[0];
			Для Каждого СтрокаТ Из СтрокиТелефон Цикл
				Если СтрокаТ.Вид.Предопределенный Тогда
					ОсновнойТелефонСтрока = СтрокаТ;
				КонецЕсли;
			КонецЦикла;
			ОсновнойТелефонСтрока.CRM_ОсновнойДляСвязи = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЕстьОсновнойАдресЭП Тогда
		ОтборЭП.Удалить("CRM_ОсновнойДляСвязи");
		СтрокиЭП = КонтактнаяИнформация.НайтиСтроки(ОтборЭП);
		
		Если СтрокиЭП.Количество() > 0 Тогда
			ОсновнойАдресЭПСтрока = СтрокиЭП[0];
			Для Каждого СтрокаЭП Из СтрокиЭП Цикл
				Если СтрокаЭП.Вид.Предопределенный Тогда
					ОсновнойАдресЭПСтрока = СтрокаЭП;
				КонецЕсли;
			КонецЦикла;
			ОсновнойАдресЭПСтрока.CRM_ОсновнойДляСвязи = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(ДатаРегистрации) Тогда
			ДатаРегистрации = ТекущаяДатаСеанса();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОсновнойМенеджер) Тогда
			ТекущийПользователь = Пользователи.АвторизованныйПользователь();
			Если Не ТекущийПользователь.Служебный Тогда
				ОсновнойМенеджер = ТекущийПользователь;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Автор) Тогда
			Автор = Пользователи.АвторизованныйПользователь();
		КонецЕсли;
	ИначеЕсли ПолучитьФункциональнуюОпцию("CRM_ВестиИсториюРеквизитовКлиентов") Тогда
		СтарыеЗначенияРеквизитовОбъекта =
			РегистрыСведений.CRM_ИсторияРеквизитовОбъектов.ПолучитьСтарыеЗначенияРеквизитовОбъекта(Ссылка);
		ДополнительныеСвойства.Вставить("СтарыеЗначения", СтарыеЗначенияРеквизитовОбъекта);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
		СтруктураНомера	=
			сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ДанныеЗаполнения.АбонентКакСвязаться);
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеЗаполнения.АбонентКакСвязаться);		
		Наименование = ДанныеЗаполнения.АбонентПредставление;
		НоваяКИ = КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
		НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента");
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны), СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода 
				+ ") " 
				+ СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Телефон") Тогда
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ДанныеЗаполнения.Телефон);
		Телефон = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеЗаполнения.Телефон);		
		НоваяКИ = КонтактнаяИнформация.Добавить();
		НоваяКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
		СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Телефон);
		НоваяКИ.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.CRM_ТелефонПотенциальногоКлиента");
		НоваяКИ.НомерТелефонаБезКодов	= СтруктураНомера.НомерТелефона;		
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= ?(ЗначениеЗаполнено(СтруктураНомера.КодСтраны), СтруктураНомера.КодСтраны + " (", "(") + СтруктураНомера.КодГорода 
				+ ") " 
				+ СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= Телефон;
		КонецЕсли;	
		НоваяКИ.НомерТелефона = Телефон;
	КонецЕсли;
	Если НЕ ЭтоГруппа Тогда		
		ДатаРегистрации  = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	КонецЕсли;

КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписыватьИсторию = (ПолучитьФункциональнуюОпцию("CRM_ВестиИсториюРеквизитовКлиентов")
		 И Не ДополнительныеСвойства.Свойство("НеЗаписыватьИсторию"));
	Если Не Отказ И ЗаписыватьИсторию Тогда
		
	CRM_КлиентыСервер.ЗаписатьИсториюРеквизитовПартнера(
		Ссылка,
		Новый Структура("ПотенциальныйКлиент"),
		?(ДополнительныеСвойства.Свойство("СтарыеЗначения"), ДополнительныеСвойства.СтарыеЗначения, Неопределено),
		?(ДополнительныеСвойства.Свойство("ДатаЗаписиИстории"), ДополнительныеСвойства.ДатаЗаписиИстории, Неопределено),
		,
		(ДополнительныеСвойства.Свойство("ЭтоНовый") И ДополнительныеСвойства.ЭтоНовый));
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Если НЕ ДополнительныеСвойства.Свойство("СвязанныйПК") Тогда
			РегистрыСведений.CRM_СвязанныеПотенциальныеКлиенты.ОбновитьКлиентКонтактВСвязанных(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
